/*
### โจทย์ข้อที่ 1: `if...else` (ระบบเช็คราคาสินค้า)

**สถานการณ์:** ร้านค้ามีโปรโมชั่น ถ้าซื้อของยอดรวมตั้งแต่ 500 บาทขึ้นไป จะได้ส่วนลด 10% แต่ถ้าซื้อไม่ถึงจะได้ส่วนลดแค่ 5%

* จงประกาศตัวแปร `totalPrice` เพื่อรับราคาสินค้า
* สร้างตัวแปร `discount` เพื่อเก็บค่าส่วนลดที่คำนวณได้
* ใช้ `if...else` ในการเช็คเงื่อนไข
* พิมพ์ผลลัพธ์ออกทางหน้าจอ (ราคาก่อนลด, จำนวนส่วนลดที่ได้รับ, และราคาสุทธิ)
*/

let productprice = 600
let discount , totalPrice = 0
if (productprice >= 500){
    discount = 0.1
}else{
    discount = 0.05
}
//const discount = (productPrice >= 500) ? 0.10 : 0.05;

totalPrice = productprice * (1-discount)

console.log(`ราคาก่อนลด คือ ${productPrice}`)
console.log(`จำนวนส่วนลดที่ได้รับ ${productPrice * discount}`)
console.log(`และราคาสุทธิ คือ ${totalPrice}`)

/*
### โจทย์ข้อที่ 2: `for` Loop (แม่สูตรคูณ)

**สถานการณ์:** คุณต้องการสร้างโปรแกรมช่วยสอนเด็กประถมท่องสูตรคูณ

* จงใช้ `for` loop พิมพ์แม่สูตรคูณ **แม่ 5** ออกมา
* ให้แสดงผลตั้งแต่  จนถึง 
* ผลลัพธ์ที่แสดงควรอยู่ในรูปแบบ: `5 x 1 = 5`, `5 x 2 = 10` ... จนจบ
*/

const num = 5
for (let i = 1; i <= 12; i++) {
    console.log(`${num} x ${i} = ${num * i}`);
}